web-dev-101/web-dev-frameworks/blog-rails/blogger/app/controllers/articles_controller.rb

    def destroy
        @article = Article.find(12)
        # @article = Article.find(params[:id])
        @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 12]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My article "], ["updated_at", "2018-08-10 12:34:46.130866"], ["id", 12]]