web-dev-101/web-dev-frameworks/blog-rails/blogger/app/controllers/authors_controller.rb

INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

SELECT COUNT(*) FROM "authors"
---
  def zero_authors_or_authenticated
    unless Author.count == 0 || current_user