web-dev-101/web-dev-frameworks/blog-rails/blogger/app/controllers/tags_controller.rb

    def destroy
        @tag = Tag.find(params[:id])
        @tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]