web-dev-101/web-dev-frameworks/blog-rails/blogger/app/models/article.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 15]]
---
    def tag_list
        self.tags.collect do |tag|

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "technology"], ["created_at", "2018-08-01 17:07:07.479544"], ["updated_at", "2018-08-01 17:07:07.479544"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "ruby"], ["LIMIT", 1]]
---
    def tag_list=(tags_string)
        tag_names = tags_string.split(",").collect{|s| s.strip.downcase}.uniq
        new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }