web-dev-101/web-dev-frameworks/blog-rails/blogger/app/views/articles/show.html.erb

<p><%= @article.body %></p>
<h3>Comments (<%= @article.comments.size %>)</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 12]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 12]]